<?php

echo "<h2>Массивы</h2>";
$arr = [];   // Создали пустовой массив
$arr1 = [1,2,3,45,4]; // Создали массив с данными
echo $arr1[3]; // 45
echo "<hr>";
$arr2 = [2,3,6,8,23,12];
$arr2[1] = 100; // замена значения
echo $arr2[1];
echo "<hr>";
$arr3 = [1,3,4,7];
echo $arr3[4]; // при обращении к несуществующему элементу будет ошибка WARNING
echo "<hr>";
$arr4 = [1,2,34,2];
$arr4[4] = 76; //вложили в массив под индексом 4
echo $arr4[4];
echo "<hr>";
$arr5 = [1,2,3,4];
$arr5[] = 34; // новый элемент добавится в конец массива
echo $arr5[4];
echo "<hr>";
$arr6 = [1,2,3];
$arr6[] = 25;
print_r($arr6); // выводит удобочитаемую информацию о переменной
echo "<hr>";
$arr7[] = 2;
$arr7[] = 5;
$arr7[] = 23;
print_r($arr7); // Добавляем элементы в массив на ходу в переменную $arr7
echo "<hr>";
$arr8 = [2=>1, 3=>2,5=>3,6=>2]; // Поператор => позволяет установить свои ключи
echo $arr8[5];
echo "<hr>";
$arr9 = [1=>1,1=>2,1=>3]; //Покажет последний элемент при повторяющем ключе
echo $arr9[1];
echo "<hr>";
$arr10 = ['Tom','Sam','Bob','Alice'];
for($i = 0; $i < count($arr10); $i++){
    echo "$arr10[$i] <br>";
}
echo "<hr>";

$arr11 = [ 1=>'Tom', 4=>'Sam', 5=>'Bob', 21=>'Alice'];
foreach ($arr11 as $item){
    echo $item . "<br>";
}
echo "<hr>";
foreach ($arr11 as $key => $item){
    echo $key . " - " . $item . "<br>"; //Выводим ключ - значение массива
}


